🔢 funcao 👉👈📥
    🔢 a✋
    a ⬅️ 1✋
    ♾️ 👉👉a 👇 3👈 🚻 👉a ⬅️➡️ 3👈👈📥
        ▶️👉a👈✋
        a ⬅️ a ➕1✋
    📤
    ↩️👉123👈✋
📤

🔢 a✋
a⬅️funcao 👉👈✋
▶️👉a👈✋


/*
🔢 a✋
🔢 x✋
🔢 y✋
a ⬅️ ⏺️👉👈✋
▶️👉a👈✋
🤔👉a ⬅️➡️ 2👈📥
    x ⬅️ a ⬅️➡️ 2✋
    ▶️👉x👈✋
📤
🤷📥
    x ⬅️ a ⬅️➡️ 3✋
    ▶️👉x👈✋
📤
x ⬅️ 3✋
y ⬅️ 0✋
♾️👉y👇x👈📥
    ▶️👉y👈✋
    y ⬅️ y➕1✋
📤
*/
/*
▶️👉1➕1👈✋
▶️👉1➖1👈✋
▶️👉1❌1👈✋
▶️👉1➗1👈✋
▶️👉➖➖➖1👈✋
*/
/*
🤔 👉1⬅️➡️1👈
    ▶️👉1👈✋
*/
/*
🤔 👉1⬅️➡️1👈
▶️👉1👈✋
*/
/*
🔢 x1✋
1x ⬅️ 432✋
▶️👉1x👈✋
*/
/*
🤔 👉1⬅️➡️1👈 📥
    ▶️👉1👈✋
📤
🤷 📥
    ▶️👉1👈✋
📤
🤷 📥
    ▶️👉1👈✋
📤
*/
/*
▶️👉"teste"👈✋
*/
/*
🔠 letra✋
🔠 palavra✋
letra ⬅️ "a"✋
▶️👉letra👈✋
palavra ⬅️ ⏺️👉👈✋
▶️👉palavra👈✋
*/
/*
🔢 y, z✋
y ⬅️ 2✋
z ⬅️ 👉y ⬅️➡️ 2👈✋
▶️👉y➕z👈✋
▶️👉y➖z👈✋
▶️👉y❌z👈✋
▶️👉y➗z👈✋
▶️👉y ⬅️➡️ z👈✋
▶️👉y 👇 z👈✋
▶️👉y 👆 z👈✋
*/
/*
🔠 a✋
🔠 b✋
🔢 x_1✋
🔢 y✋
🔢 z✋
x_1 ⬅️ 1✋ y ⬅️ 1✋ z ⬅️ 2✋
a ⬅️ "abc"✋
b ⬅️ "def"✋
▶️👉a🖇️b👈✋
▶️👉a🖇️x_1👈✋
▶️👉x_1🖇️a👈✋
▶️👉y🖇️z👈✋
▶️👉a🖇️👉x_1⬅️➡️1👈👈✋
▶️👉a ⬅️➡️ a👈✋
▶️👉a 👇 b👈✋
▶️👉a 👆 b👈✋
*/
/*
🔢 x✋
🔢 x✋
*/
/*
🔢 x✋
x ⬅️ ⏺️👉👈✋
▶️ 👉x👈✋
*/